supported_languages = ['ru', 'en']

text = {"ru":{"user_profile":{"step_1": "🔘 ⚪ ⚪ ⚪ ⚪ ⚪\n\n"
                              "Привет, <b>{first_name}</b>!\n"
                              "Готов к новым знакомствам?\n\n"
                              "Чтобы начать нужно выполнить несколько простых шагов:"
                              "\n\n🔸 Шаг 1. Подтверди, что тебе есть 18 лет\n\n"
                              "<i>По законам многих стран, чтобы пользоваться сервисами, подобными нашему, тебе должно быть больше 18 лет</i>\n\n"
                              "Дай своё согласие, что ты понимаешь все риски и уже достиг нужного возраста 🪪",

                              "step_2": "🟢 🔘 ⚪ ⚪ ⚪ ⚪\n\n"
                              "🔸 Шаг 2. Отправь свое местоположение 🛰️\n\n"
                              "Поиск производится среди людей из того же города, что и ты📌\n\n",

                              "step_3": "🟢 🟢 🔘 ⚪ ⚪ ⚪\n\n"
                              "🔸 Шаг 3. Укажи свой пол ⚤",

                              "step_4": "🟢 🟢 🟢 🔘 ⚪ ⚪\n\n"
                              "🔸 Шаг 4. Укажи кого ты ищешь ⚤",

                              "step_5": "🟢 🟢 🟢 🟢 🔘 ⚪\n\n"
                              "🔸 Шаг 5. Отправь свое фото 🤳"
                              "\n<i>Желательно сэлфи</i>",

                              "step_6": "🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                              "🔸 Шаг 6. Расскажи коротко о себе 📝\n<i>Постарайся уложиться в 2-3 строки</i>",
                              
                              "username_error": "⚠️ Для использования бота необходимо установить <b>username</b> в Telegram."
                              "\nКак это сделать:"
                              "\n1️⃣ Откройте Telegram → Настройки → Имя пользователя (tg://settings/username)"
                              "\n2️⃣ Придумайте уникальное <b>Имя пользователя</b>"
                              "\n3️⃣ Сохрани ✅"
                              "\nПосле этого вернись в бота \nи нажми 👉 /start , чтобы продолжить регистрацию.",

                              "min_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                              "❌ Шаг 6 не выполнен.\nМинимальное кол-во символов {MIN_COUNT_SYMBOLS}.\n"
                              "Ваш текст содержит {text_length} символов.\n"
                              "Попробуй дополнить описание и отправь еще раз",
                              "max_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                              "❌ Шаг 6 не выполнен.\nКоличество символов превышает лимит в {MAX_COUNT_SYMBOLS} символов.\n"
                              "Ваш текст содержит {text_length} символов.\n"
                              "Попробуй сократить описание и отправь еще раз",
                              
                              "profile": "<b>{first_name}</b>"
                              "\n📌 {country_local}, {city_local}"
                              "\nПол: {gender}"
                              "\nВ поиске: {gender_search}"
                              "\nО себе: <i>{about_me}</i>",
                              
                              "get_location_message": "<i>Если вы используете десктоп/ПК вам необходимо авторизоваться на мобильном устройстве, чтобы выполнить этот этап</i>"},
            "notifications":{"18year":"Отлично! Ты подтвердил, что тебе больше 18 лет",
                             "gender": "Отлично! Ты указал: {user_gender}",
                             "gender_search": "Отлично! Ты указал: {gender_search}",
                             }}}

