supported_languages = ['ru', 'en']

text = {"ru":{"user_profile":{"start_message": "Привет, {first_name}!\nГотов к новым знакомствам?\n\n"
                              "Чтобы начать нужно выполнить несколько простых шагов:"
                              "\nШаг 1. Подтверди что тебе есть 18 лет"
                              "\nШаг 2. Отправь свое местоположение"
                              "\nШаг 3. Укажи свой пол"
                              "\nШаг 4. Кого ты ищешь?"
                              "\nШаг 5. Отправь свое фото"
                              "\nШаг 6. Расскажи коротко о себе"
                              "\n\n👉 Шаг 1. Подтверди, что тебе есть 18 лет\n\n"
                              "<i>По законам многих стран, чтобы пользоваться сервисами, подобными нашему, тебе должно быть больше 18 лет.</i>\n\n"
                              "Дай своё согласие, что ты понимаешь все риски и уже достиг нужного возраста."}}}

