from models import Gender


TEXT = {"user_profile":{"step_1": "🔘 ⚪ ⚪ ⚪ ⚪ ⚪\n\n"
                        "مرحبًا، <b>{first_name}</b>!\n"
                        "جاهز للتعارف الجديد؟\n\n"
                        "لبدء الاستخدام، يجب إتمام بعض الخطوات البسيطة:\n\n"
                        "🔸 الخطوة 1. بالضغط على «بدء التسجيل» أنت:"
                        "\n🔹 تؤكد أنك تبلغ 18 عامًا 🪪"
                        '\n🔹 توافق على <a href="{notion_site}">اتفاقية الاستخدام</a>'
                        '\n🔹 توافق على <a href="{notion_site}">سياسة الخصوصية</a>',

                        "step_2": "🟢 🔘 ⚪ ⚪ ⚪ ⚪\n\n"
                        "🔸 الخطوة 2. أرسل موقعك 🛰️\n\n"
                        "<i>سيتم البحث بين الأشخاص في مدينتك وبلدك 📌</i>",

                        "step_3": "🟢 🟢 🔘 ⚪ ⚪ ⚪\n\n"
                        "🔸 الخطوة 3. اختر جنسك ⚧️",

                        "step_4": "🟢 🟢 🟢 🔘 ⚪ ⚪\n\n"
                        "🔸 الخطوة 4. حدد من تبحث عنه ⚧️",

                        "step_5": "🟢 🟢 🟢 🟢 🔘 ⚪\n\n"
                        "🔸 الخطوة 5. أرسل صورتك 🤳"
                        "\n<i>يفضّل صورة سيلفي واضحة للوجه</i>",

                        "step_6": "🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "🔸 الخطوة 6. اكتب نبذة قصيرة عن نفسك 📝"
                        "\n<i>من الأفضل أن تكون 2-3 جمل</i>",
                        
                        "username_error": "⚠️ لاستخدام البوت، يجب تعيين <b>اسم مستخدم</b> في تيليجرام."
                        "\nكيف تفعل ذلك:"
                        "\n1️⃣ افتح تيليجرام → الإعدادات → اسم المستخدم (tg://settings/username)"
                        "\n2️⃣ اختر اسم مستخدم فريد"
                        "\n3️⃣ احفظ التغييرات ✅"
                        "\nبعدها عد إلى البوت واضغط «إعادة التسجيل»",

                        "min_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ الخطوة 6 غير مكتملة"
                        "\nالحد الأدنى — {MIN_COUNT_SYMBOLS} حرفًا"
                        "\nلديك — {text_length} حرفًا"
                        "\nأضف بعض التفاصيل وأرسل مرة أخرى",

                        "max_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ الخطوة 6 غير مكتملة."
                        "\nتم تجاوز الحد: الأقصى — {MAX_COUNT_SYMBOLS} حرفًا."
                        "\nلديك — {text_length} حرفًا."
                        "\nقلّص النص وأعد الإرسال",
                        
                        "profile": "🪪 <b>{first_name}</b>"
                        "\n📌 {country_local}, {city_local}"
                        "\n{gender_emoji} {gender}"
                        "\n🔍 {gender_search}"
                        "\nعني: <i>{about_me}</i>",
                        
                        "get_location_message": "<i>إذا كنت تستخدم تيليجرام على الكمبيوتر، أكمل هذه الخطوة على الهاتف</i>",
                        "waiting": "جارٍ الانتظار ...",
                        },
       
        "notifications":{"18year":"رائع! لقد أكدت أنك أكبر من 18 عامًا",
                         "gender": "ممتاز! لقد اخترت: {user_gender}",
                         "gender_search": "ممتاز! تبحث عن: {gender_search}",
                         "not_found": "لا يوجد أحد في منطقتك حاليًا 😔",
                         "not_username": "اسم المستخدم غير موجود ❌",
                         "reloaded": "تم تحديث القائمة 🔄",
                         "empty": "لا يوجد",
                         "LOVE": "ترغب في موعد مع {name}",
                         "SEX": "ترغب بـ {name}",
                         "CHAT": "ترغب بالدردشة مع {name}",
                         "SKIP": "تخطيت {name}",
                         "delete": "تم حذف الحساب ❌",
                         "payment_sent": "تم إرسال الدفع ⭐️",
                         "unavailable": "حساب {name} غير متاح حاليًا 🚫",
                         "incognito" : {
                             True: "تم تفعيل وضع التخفي ✅",
                             False: "تم إيقاف وضع التخفي 🚫"},
                         },
        "match_menu":{"start": "هنا يمكنك مشاهدة:"
                      "\n🔹 التطابقات - رغباتكم متشابهة"
                      "\n🔹 المجموعة - الأشخاص الذين سمحوا لك بمراسلتهم"
                      "\n🔹 تفاعلات الآخرين على ملفك",
                      "you_want": "أنتما الاثنان تريدان {reaction}",
                      "empty": {"LOVE": "هنا سيظهر أشخاص يريدون الخروج معك إلى ☕ <b>موعد</b>",
                                "SEX": "هنا سيظهر أشخاص يريدون معك 👩‍❤️‍💋‍👨 <b>علاقة</b>",
                                "CHAT": "هنا سيظهر أشخاص يريدون 💬 <b>الدردشة</b> معك"},
                      "match_empty": "هنا سيظهر الأشخاص الذين تتطابق رغباتكم"
                                    "\nيمكنك مراسلتهم ✉️",
                      "collection_empty": "المجموعة فارغة"
                                           "\nأضف ملفات إلى مجموعتك ✨."
                                           "\nيمكنك مراسلة أي شخص في المجموعة ✉️"},
        "search_menu":{"start": "🔍 ابحث عن شريك",
                       "not_found": "لا يوجد أحد في منطقتك الآن 😔"
                       "\nجرّب لاحقًا ☕"},
        "payment": {"incognito":{"label": "تفعيل وضع التخفي",
                                 "title": "تفعيل وضع التخفي",
                                "description": "اشترِ مرة واحدة — وفَعّل/أوقف وقتما شئت!"
                                "\nفي هذا الوضع، لن يراك أحد في البحث، لكن يمكنك أنت تصفح الآخرين."},

                    "collection": {"label": "أضف {target_name} إلى ✨ المجموعة",
                                   "title": "أضف {target_name} إلى ✨ المجموعة ",
                                   "description": "بإضافة {target_name} إلى ✨ المجموعة، ستحصل على حق الوصول لملفه/ملفها ويمكنك المراسلة"}
        }}


BUTTONS_TEXT = {"begin":"بدء ✅",
                "reload": "تحديث 🔄",
                "back":"⬅️ رجوع",
                "next":"➡️ التالي",
                "return":"⏮️ القائمة",
                "delete": "🗑️ حذف",
                "search_menu": {"start":"🔍 بدء البحث"
                                },
                "pay": "ادفع عبر Telegram Stars ⭐️",
                "reaction": {"LOVE":"☕ موعد",
                             "SEX":"🔥 علاقة",
                             "CHAT": "💬 دردشة",
                             "SKIP":"⏩ تخطٍ"},
                "match_menu":{"start":"💘 شاهد التطابقات",
                              "match":"💘 تطابق [{match_count}]",
                              "collection":"✨ مجموعة [{collection_count}]",
                              "love":"موعد [{love_count}]",
                              "sex":"علاقة [{sex_count}]",
                              "chat":"دردشة [{chat_count}]",
                              "add_to_collection":"إضافة للمجموعة {amount} ⭐️",
                              "send_message":"✉️ أرسل رسالة"},
                "gender": {"man": "رجل 🧔🏻",
                           "woman":"امرأة 👩🏻‍🦰",
                           "any":"آخر 👱"},
                "gender_search": {"man": "أبحث عن رجل 🧔🏻",
                                  "woman":"أبحث عن امرأة 👩🏻‍🦰",
                                  "any":"الجنس غير مهم 🧔🏻👩🏻‍🦰👱"},
                "incognito":{"not_active":"🫥 وضع التخفي",
                             "on":"✅ التخفي مفعل",
                             "off":"🚫 التخفي متوقف",
                             },
                "profile":{"edit":"✏ تعديل",
                           "retry":"🔄 إعادة التسجيل"},
                "location":{"send":"📍 أرسل الموقع",
                            "press":"📍 اضغط للإرسال"}
                }


# 👩‍❤️‍💋‍👨 🧔 👩 👤


GENDER_LABELS = {
    Gender.MAN: "رجل 🧔🏻",
    Gender.WOMAN: "امرأة 👩🏻‍🦰",
    Gender.ANY: "آخر 👱",
}


GENDER_SEARCH_LABELS = {
    Gender.MAN: "أبحث عن رجل 🧔🏻",
    Gender.WOMAN: "أبحث عن امرأة 👩🏻‍🦰",
    Gender.ANY: "الجنس غير مهم 🧔🏻👩🏻‍🦰👱",
}


GENDER_EMOJI = {
    Gender.MAN: "♂️",
    Gender.WOMAN: "♀️",
    Gender.ANY: "⚧️",
}
