from models import Gender


TEXT = {"user_profile":{"step_1": "🔘 ⚪ ⚪ ⚪ ⚪ ⚪\n\n"
                        "Прывітанне, <b>{first_name}</b>!\n"
                        "Гатовы да новых знаёмстваў?\n\n"
                        "Каб пачаць, трэба зрабіць некалькі простых крокаў:\n\n"
                        "🔸 Крок 1. Націскаючы «Пачаць рэгістрацыю» ты:"
                        "\n🔹Пацвярджаеш, што табе споўнілася 18 гадоў 🪪"
                        '\n🔹Прымаеш <a href="{notion_site}">Карыстальніцкае пагадненне</a>'
                        '\n🔹Згаджаешся з <a href="{notion_site}">Палітыкай канфідэнцыйнасці</a>',

                        "step_2": "🟢 🔘 ⚪ ⚪ ⚪ ⚪\n\n"
                        "🔸 Крок 2. Дашлі сваю лакацыю 🛰️\n\n"
                        "<i>Пошук будзе весціся сярод людзей з твайго горада і краіны 📌</i>",

                        "step_3": "🟢 🟢 🔘 ⚪ ⚪ ⚪\n\n"
                        "🔸 Крок 3. Абяры свой пол ⚧️",

                        "step_4": "🟢 🟢 🟢 🔘 ⚪ ⚪\n\n"
                        "🔸 Крок 4. Пакажы, каго ты шукаеш ⚧️",

                        "step_5": "🟢 🟢 🟢 🟢 🔘 ⚪\n\n"
                        "🔸 Крок 5. Дашлі сваё фота 🤳"
                        "\n<i>Лепш сэлфі, дзе добра відаць твар</i>",

                        "step_6": "🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "🔸 Крок 6. Раскажы крыху пра сябе 📝"
                        "\n<i>Напішы коратка — 2-3 радкі</i>",
                        
                        "username_error": "⚠️ Каб карыстацца ботам, трэба ўсталяваць <b>username</b> у Telegram."
                        "\nЯк гэта зрабіць:"
                        "\n1️⃣ Адкрый Telegram → Налады → Імя карыстальніка (tg://settings/username)"
                        "\n2️⃣ Прыдумай унікальнае <b>Імя карыстальніка</b>"
                        "\n3️⃣ Захавай змены ✅"
                        "\nПасля вярніся ў бота і націсні «Паўтарыць рэгістрацыю»",

                        "min_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ Крок 6 не выкананы"
                        "\nМінімум — {MIN_COUNT_SYMBOLS} знакаў"
                        "\nУ цябе — {text_length} знакаў"
                        "\nДапоўні апісанне і дашлі зноў",

                        "max_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ Крок 6 не выкананы."
                        "\nПеравышаны ліміт: максімум — {MAX_COUNT_SYMBOLS} знакаў."
                        "\nУ цябе — {text_length} знакаў."
                        "\nСкароці апісанне і дашлі зноў",
                        
                        "profile": "🪪 <b>{first_name}</b>"
                        "\n📌 {country_local}, {city_local}"
                        "\n{gender_emoji} {gender}"
                        "\n🔍 {gender_search}"
                        "\nПра сябе: <i>{about_me}</i>",
                        
                        "get_location_message": "<i>Калі ты карыстаешся Telegram на камп’ютары, пройдзi гэты крок на мабільнай прыладзе</i>",
                        "waiting": "Чакаем ...",
                        },
       
        "notifications":{"18year":"Цудоўна! Ты пацвердзіў, што табе больш за 18 гадоў",
                         "gender": "Добра! Ты пазначыў: {user_gender}",
                         "gender_search": "Добра! Ты шукаеш: {gender_search}",
                         "not_found": "Пакуль што нікога не знайшлося ў тваім рэгіёне 😔",
                         "not_username": "Няма імя карыстальніка ❌",
                         "reloaded": "Меню абноўлена 🔄",
                         "empty": "Не знойдзена",
                         "LOVE": "Ты хочаш на спатканне з {name}",
                         "SEX": "Ты хочаш {name}",
                         "CHAT": "Ты хочаш пагаварыць з {name}",
                         "SKIP": "Ты прапусціў {name}",
                         "delete": "Карыстальнік выдалены ❌",
                         "payment_sent": "Плацеж адпраўлены ⭐️",
                         "unavailable": "Акаўнт {name} цяпер недаступны 🚫",
                         "incognito" : {
                             True: "Рэжым Інкогніта ўключаны ✅",
                             False: "Рэжым Інкогніта выключаны 🚫"},
                         },
        "match_menu":{"start": "Тут ты можаш паглядзець:"
                      "\n🔹 Супадзенні — вашыя жаданні супалі"
                      "\n🔹 Калекцыя — ты адкрыў доступ да гэтых людзей"
                      "\n🔹 Рэакцыі іншых людзей на тваю анкету",
                      "you_want": "Вы абодва хочаце {reaction}",
                      "empty": {"LOVE": "Тут будуць з’яўляцца людзі, якія хочуць пайсці з табой на ☕ <b>Спатканне</b>",
                                "SEX": "Тут будуць з’яўляцца людзі, якія хочуць з табой у 👩‍❤️‍💋‍👨 <b>Пастэль</b>",
                                "CHAT": "Тут будуць з’яўляцца людзі, якія хочуць 💬 <b>Паразмаўляць</b> з табой"},
                      "match_empty": "Тут будуць людзі, з якімі супалі вашыя жаданні"
                                    "\nТы зможаш ім напісаць ✉️",
                      "collection_empty": "Калекцыя пустая"
                                           "\nДадавай анкеты ў калекцыю ✨."
                                           "\nЛюдзям з калекцыі можна напісаць ✉️"},
        "search_menu":{"start": "🔍 Знайсці партнёра",
                       "not_found": "Пакуль што нікога не знайшлося ў тваім рэгіёне 😔"
                       "\nПаспрабуй пазней ☕"},
        "payment": {"incognito":{"label": "Уключыць Інкогніта",
                                 "title": "Уключыць рэжым Інкогніта",
                                "description": "Аплаці адзін раз — і ўключай/выключай калі хочаш!"
                                "\nУ гэтым рэжыме цябе не відаць у пошуку, але ты можаш глядзець анкеты іншых."},

                    "collection": {"label": "Дадаць {target_name} у ✨ Калекцыю",
                                   "title": "Дадаць {target_name} у ✨ Калекцыю ",
                                   "description": "Дадаўшы ў ✨ Калекцыю, ты атрымаеш доступ да профілю {target_name} і зможаш ёй/яму напісаць"}
        }}


BUTTONS_TEXT = {"begin":"Пачаць ✅",
                "reload": "Абнавіць 🔄",
                "back":"⬅️ Назад",
                "next":"➡️ Далей",
                "return":"⏮️ У меню",
                "delete": "🗑️ Выдаліць",
                "search_menu": {"start":"🔍 Пошук"},
                "pay": "Аплаціць ⭐️",
                "reaction": {"LOVE":"☕ Спатканне",
                             "SEX":"🔥 Пастэль",
                             "CHAT":"💬 Размова",
                             "SKIP":"⏩ Прапусціць"},
                "match_menu":{"start":"💘 Супадзенні",
                              "match":"💘 Супадзенні [{match_count}]",
                              "collection":"✨ Калекцыя [{collection_count}]",
                              "love":"Спатканні [{love_count}]",
                              "sex":"Пастэль [{sex_count}]",
                              "chat":"Размовы [{chat_count}]",
                              "add_to_collection":"+ Калекцыя {amount} ⭐️",
                              "send_message":"✉️ Напісаць"},
                "gender": {"man": "Хлопец 🧔🏻",
                           "woman":"Дзяўчына 👩🏻‍🦰",
                           "any":"Іншае 👱"},
                "gender_search": {"man": "Шукаю хлопца 🧔🏻",
                                  "woman":"Шукаю дзяўчыну 👩🏻‍🦰",
                                  "any":"Пол не мае значэння 🧔🏻👩🏻‍🦰👱"},
                "incognito":{"not_active":"🫥 Інкогніта",
                             "on":"✅ Інкогніта ўкл.",
                             "off":"🚫 Інкогніта выкл.",
                             },
                "profile":{"edit":"✏ Рэдагаваць",
                           "retry":"🔄 Паўтарыць"},
                "location":{"send":"📍 Даслаць лакацыю",
                            "press":"📍 Націсні, каб даслаць"}
                }


# 👩‍❤️‍💋‍👨 🧔 👩 👤


GENDER_LABELS = {
    Gender.MAN: "Хлопец 🧔🏻",
    Gender.WOMAN: "Дзяўчына 👩🏻‍🦰",
    Gender.ANY: "Іншае 👱",
}


GENDER_SEARCH_LABELS = {
    Gender.MAN: "Шукаю хлопца 🧔🏻",
    Gender.WOMAN: "Шукаю дзяўчыну 👩🏻‍🦰",
    Gender.ANY: "Пол не мае значэння 🧔🏻👩🏻‍🦰👱",
}


GENDER_EMOJI = {
    Gender.MAN: "♂️",
    Gender.WOMAN: "♀️",
    Gender.ANY: "⚧️",
}
