from models import Gender


TEXT = {"user_profile":{"step_1": "🔘 ⚪ ⚪ ⚪ ⚪ ⚪\n\n"
                        "नमस्ते, <b>{first_name}</b>!\n"
                        "क्या तुम नए दोस्तों और रिश्तों के लिए तैयार हो? 💫\n\n"
                        "शुरू करने के लिए कुछ आसान स्टेप पूरे करो:\n\n"
                        "🔸 स्टेप 1. «पंजीकरण शुरू करें» दबाकर तुम:"
                        "\n🔹पुष्टि करते हो कि तुम्हारी उम्र 18+ है 🪪"
                        '\n🔹<a href="{notion_site}">यूज़र एग्रीमेंट</a> स्वीकार करते हो'
                        '\n🔹<a href="{notion_site}">प्राइवेसी पॉलिसी</a> से सहमत हो',

                        "step_2": "🟢 🔘 ⚪ ⚪ ⚪ ⚪\n\n"
                        "🔸 स्टेप 2. अपना लोकेशन भेजो 🛰️\n\n"
                        "<i>सर्च तुम्हारे शहर और देश के लोगों में होगा 📌</i>",

                        "step_3": "🟢 🟢 🔘 ⚪ ⚪ ⚪\n\n"
                        "🔸 स्टेप 3. अपना जेंडर चुनो ⚧️",

                        "step_4": "🟢 🟢 🟢 🔘 ⚪ ⚪\n\n"
                        "🔸 स्टेप 4. बताओ, तुम किसे ढूंढ रहे हो ⚧️",

                        "step_5": "🟢 🟢 🟢 🟢 🔘 ⚪\n\n"
                        "🔸 स्टेप 5. अपनी फोटो भेजो 🤳"
                        "\n<i>सेल्फ़ी हो तो बेहतर — चेहरा साफ़ दिखना चाहिए</i>",

                        "step_6": "🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "🔸 स्टेप 6. अपने बारे में थोड़ा लिखो 📝"
                        "\n<i>संक्षिप्त रखो — 2-3 लाइन काफी हैं</i>",
                        
                        "username_error": "⚠️ बॉट यूज़ करने के लिए <b>username</b> सेट करना ज़रूरी है."
                        "\nकैसे करें:"
                        "\n1️⃣ Telegram खोलें → सेटिंग्स → यूज़रनेम (tg://settings/username)"
                        "\n2️⃣ यूनिक <b>यूज़रनेम</b> चुनें"
                        "\n3️⃣ सेव करें ✅"
                        "\nइसके बाद बॉट पर वापस आकर \"पंजीकरण दोबारा करें\" दबाएं",

                        "min_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ स्टेप 6 पूरा नहीं हुआ"
                        "\nकम से कम — {MIN_COUNT_SYMBOLS} अक्षर चाहिए"
                        "\nतुम्हारे पास - {text_length} अक्षर हैं"
                        "\nथोड़ा और जोड़ो और दोबारा भेजो",

                        "max_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ स्टेप 6 पूरा नहीं हुआ"
                        "\nलिमिट से ज्यादा: मैक्स — {MAX_COUNT_SYMBOLS} अक्षर."
                        "\nतुम्हारे पास — {text_length} अक्षर."
                        "\nथोड़ा छोटा करके दोबारा भेजो",
                        
                        "profile": "🪪 <b>{first_name}</b>"
                        "\n📌 {country_local}, {city_local}"
                        "\n{gender_emoji} {gender}"
                        "\n🔍 {gender_search}"
                        "\nमेरे बारे में: <i>{about_me}</i>",
                        
                        "get_location_message": "<i>अगर तुम Telegram कंप्यूटर पर चला रहे हो, तो यह स्टेप मोबाइल से पूरा करो</i>",
                        "waiting": "इंतज़ार हो रहा है ...",
                        },
       
        "notifications":{"18year":"बढ़िया! तुमने पुष्टि की कि तुम 18+ हो 🎉",
                         "gender": "ठीक है! तुमने चुना: {user_gender}",
                         "gender_search": "ठीक है! तुम ढूंढ रहे हो: {gender_search}",
                         "not_found": "अभी तक तुम्हारे इलाके में कोई नहीं मिला 😔",
                         "not_username": "यूज़रनेम नहीं मिला ❌",
                         "reloaded": "मेन्यू रिफ्रेश हो गया 🔄",
                         "empty": "कुछ नहीं मिला",
                         "LOVE": "तुम {name} के साथ डेट पर जाना चाहते हो ☕",
                         "SEX": "तुम {name} को चाहते हो 🔥",
                         "CHAT": "तुम {name} से चैट करना चाहते हो 💬",
                         "SKIP": "तुमने {name} को स्किप किया ⏩",
                         "delete": "यूज़र डिलीट किया गया ❌",
                         "payment_sent": "पेमेंट भेज दिया ⭐️",
                         "unavailable": "अकाउंट {name} अभी उपलब्ध नहीं है 🚫",
                         "incognito" : {
                             True: "इन्कॉग्निटो मोड चालू ✅",
                             False: "इन्कॉग्निटो मोड बंद 🚫"},
                         },
        "match_menu":{"start": "यहां तुम देख सकते हो:"
                      "\n🔹 मैच — जब तुम्हारी चाहतें मिलें"
                      "\n🔹 कलेक्शन — जिनसे चैट खोल दी है"
                      "\n🔹 दूसरों की रिएक्शन तुम्हारी प्रोफ़ाइल पर",
                      "you_want": "तुम दोनों {reaction} चाहते हो",
                      "empty": {"LOVE": "यहां वो लोग दिखेंगे जो तुम्हारे साथ ☕ <b>डेट</b> पर जाना चाहते हैं",
                                "SEX": "यहां वो लोग दिखेंगे जो तुम्हारे साथ 👩‍❤️‍💋‍👨 <b>पलंग</b> शेयर करना चाहते हैं",
                                "CHAT": "यहां वो लोग दिखेंगे जो तुमसे 💬 <b>चैट</b> करना चाहते हैं"},
                      "match_empty": "यहां वो लोग दिखेंगे जिनसे तुम्हारी चाहतें मैच हुईं"
                                    "\nतुम उन्हें मैसेज कर सकते हो ✉️",
                      "collection_empty": "कलेक्शन खाली है"
                                           "\nप्रोफ़ाइल जोड़ो ✨"
                                           "\nकलेक्शन में जोड़े लोगों को मैसेज भेज सकते हो ✉️"},
        "search_menu":{"start": "🔍 पार्टनर खोजो",
                       "not_found": "अभी तक तुम्हारे इलाके में कोई नहीं मिला 😔"
                       "\nबाद में ट्राय करो ☕"},
        "payment": {"incognito":{"label": "इन्कॉग्निटो मोड एक्टिवेट करो",
                                 "title": "इन्कॉग्निटो मोड एक्टिवेट करो",
                                "description": "एक बार खरीदो — और जब चाहो चालू/बंद करो!"
                                "\nइस मोड में तुम सर्च में नहीं दिखोगे, लेकिन दूसरों की प्रोफ़ाइल देख सकते हो।"},


                    "collection": {"label": "{target_name} को ✨ कलेक्शन में जोड़ो",
                                   "title": "{target_name} को ✨ कलेक्शन में जोड़ो ",
                                   "description": "✨ कलेक्शन में जोड़ने के बाद, तुम्हें {target_name} की प्रोफ़ाइल एक्सेस मिलेगी और तुम उनसे चैट कर सकोगे"}
        }}


BUTTONS_TEXT = {"begin":"पंजीकरण शुरू ✅",
                "reload": "रिफ्रेश 🔄",
                "back":"⬅️ पीछे",
                "next":"आगे ➡️",
                "return":"⏮️ मेन्यू में वापस",
                "delete": "🗑️ प्रोफ़ाइल हटाओ",
                "search_menu": {"start":"🔍 सर्च शुरू करो"
                                },
                "pay": "Telegram Stars से पे करो ⭐️",
                "reaction": {"LOVE":"☕ डेट",
                             "SEX":"🔥 पलंग",
                             "CHAT": "💬 चैट",
                             "SKIP":"⏩ स्किप"},
                "match_menu":{"start":"💘 मैच देखें",
                              "match":"💘 मैच [{match_count}]",
                              "collection":"✨ कलेक्शन [{collection_count}]",
                              "love":"डेट [{love_count}]",
                              "sex":"पलंग [{sex_count}]",
                              "chat":"चैट [{chat_count}]",
                              "add_to_collection":"कलेक्शन में जोड़ो {amount} ⭐️",
                              "send_message":"✉️ मैसेज भेजो"},
                "gender": {"man": "लड़का 🧔🏻",
                           "woman":"लड़की 👩🏻‍🦰",
                           "any":"अन्य 👱"},
                "gender_search": {"man": "लड़का ढूंढ रहा हूँ 🧔🏻",
                                  "woman":"लड़की ढूंढ रहा हूँ 👩🏻‍🦰",
                                  "any":"जेंडर मायने नहीं रखता 🧔🏻👩🏻‍🦰👱"},
                "incognito":{"not_active":"🫥 इन्कॉग्निटो बनो",
                             "on":"✅ इन्कॉग्निटो ऑन",
                             "off":"🚫 इन्कॉग्निटो ऑफ",
                             },
                "profile":{"edit":"✏ प्रोफ़ाइल बदलो",
                           "retry":"🔄 पंजीकरण दोहराओ"},
                "location":{"send":"📍 लोकेशन भेजो",
                            "press":"📍 भेजने के लिए दबाओ"}
                }


# 👩‍❤️‍💋‍👨 🧔 👩 👤


GENDER_LABELS = {
    Gender.MAN: "लड़का 🧔🏻",
    Gender.WOMAN: "लड़की 👩🏻‍🦰",
    Gender.ANY: "अन्य 👱",
}


GENDER_SEARCH_LABELS = {
    Gender.MAN: "लड़का ढूंढ रहा हूँ 🧔🏻",
    Gender.WOMAN: "लड़की ढूंढ रहा हूँ 👩🏻‍🦰",
    Gender.ANY: "जेंडर मायने नहीं रखता 🧔🏻👩🏻‍🦰👱",
}


GENDER_EMOJI = {
    Gender.MAN: "♂️",
    Gender.WOMAN: "♀️",
    Gender.ANY: "⚧️",
}
