from models import Gender


TEXT = {"user_profile":{"step_1": "🔘 ⚪ ⚪ ⚪ ⚪ ⚪\n\n"
                        "Здраво, <b>{first_name}</b>!\n"
                        "Спреман/спремна за нова познанства? 😉\n\n"
                        "Да кренемо, треба да одрадиш неколико једноставних корака:\n\n"
                        "🔸 Корак 1. Кликом на „Почни регистрацију“ ти:"
                        "\n🔹Потврђујеш да имаш 18+ 🪪"
                        '\n🔹Прихваташ <a href="{notion_site}">Кориснички уговор</a>'
                        '\n🔹Слажеш се са <a href="{notion_site}">Политиком приватности</a>',

                        "step_2": "🟢 🔘 ⚪ ⚪ ⚪ ⚪\n\n"
                        "🔸 Корак 2. Пошаљи своју локацију 🛰️\n\n"
                        "<i>Претрага ће бити међу људима из твог града и земље 📌</i>",

                        "step_3": "🟢 🟢 🔘 ⚪ ⚪ ⚪\n\n"
                        "🔸 Корак 3. Изабери свој пол ⚧️",

                        "step_4": "🟢 🟢 🟢 🔘 ⚪ ⚪\n\n"
                        "🔸 Корак 4. Реци кога тражиш ⚧️",

                        "step_5": "🟢 🟢 🟢 🟢 🔘 ⚪\n\n"
                        "🔸 Корак 5. Пошаљи своју фотку 🤳"
                        "\n<i>Боље селфи, где се јасно види лице</i>",

                        "step_6": "🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "🔸 Корак 6. Реци нешто укратко о себи 📝"
                        "\n<i>Пробај 2–3 реченице</i>",
                        
                        "username_error": "⚠️ За коришћење бота мораш имати <b>username</b> у Телеграму."
                        "\nКако то да подесиш:"
                        "\n1️⃣ Отвори Telegram → Подешавања → Корисничко име (tg://settings/username)"
                        "\n2️⃣ Смишљаш јединствено <b>Корисничко име</b>"
                        "\n3️⃣ Сачувај измене ✅"
                        "\nПосле тога врати се у бота и кликни „Понови регистрацију“",

                        "min_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ Корак 6 није завршен"
                        "\nМинимум — {MIN_COUNT_SYMBOLS} слова"
                        "\nТи имаш - {text_length}"
                        "\nДопуни опис и пошаљи поново",

                        "max_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ Корак 6 није завршен."
                        "\nПрекорачио си лимит: максимум — {MAX_COUNT_SYMBOLS} слова."
                        "\nТи имаш — {text_length}."
                        "\nСкрати опис и пошаљи поново",
                        
                        "profile": "🪪 <b>{first_name}</b>"
                        "\n📌 {country_local}, {city_local}"
                        "\n{gender_emoji} {gender}"
                        "\n🔍 {gender_search}"
                        "\nО мени: <i>{about_me}</i>",
                        
                        "get_location_message": "<i>Ако користиш Телеграм на компјутеру, овај корак уради преко мобилног</i>",
                        "waiting": "Чекамо ...",
                        },
       
        "notifications":{"18year":"Супер! Потврдио си да имаш 18+",
                         "gender": "Супер! Изабрао си: {user_gender}",
                         "gender_search": "Супер! Тражиш: {gender_search}",
                         "not_found": "Тренутно нема никога у твом региону 😔",
                         "not_username": "Нема корисничког имена ❌",
                         "reloaded": "Мени је освежен 🔄",
                         "empty": "Нема резултата",
                         "LOVE": "Желиш да изађеш са {name} ☕",
                         "SEX": "Желиш {name} 🔥",
                         "CHAT": "Желиш да ћаскаш са {name} 💬",
                         "SKIP": "Прескочио си {name} ⏩",
                         "delete": "Корисник обрисан ❌",
                         "payment_sent": "Плаћање послато ⭐️",
                         "unavailable": "Налог {name} тренутно није доступан 🚫",
                         "incognito" : {
                             True: "Инкогнито режим укључен ✅",
                             False: "Инкогнито режим искључен 🚫"},
                         },
        "match_menu":{"start": "Овде можеш да видиш:"
                      "\n🔹 Поклапања - ваше жеље се поклопиле"
                      "\n🔹 Колекција - профили којима имаш приступ"
                      "\n🔹 Реакције људи на твоју анкету",
                      "you_want": "Обострано желите {reaction}",
                      "empty": {"LOVE": "Овде ће бити људи који хоће са тобом на ☕ <b>Дејт</b>",
                                "SEX": "Овде ће бити људи који хоће са тобом у 👩‍❤️‍💋‍👨 <b>Кревет</b>",
                                "CHAT": "Овде ће бити људи који хоће 💬 <b>Ћаскање</b>"},
                      "match_empty": "Овде ће бити људи са којима се поклопе ваше жеље"
                                    "\nМожеш им писати ✉️",
                      "collection_empty": "Колекција је празна"
                                           "\nДодај профиле у колекцију ✨."
                                           "\nЊима можеш писати ✉️"},
        "search_menu":{"start": "🔍 Нађи партнера",
                       "not_found": "Тренутно нема никога у твом региону 😔"
                       "\nПробај касније ☕"},
        "payment": {"incognito":{"label": "Укључи Инкогнито",
                                 "title": "Активирај Инкогнито режим",
                                 "description": "Једном купиш — па укључујеш/искључујеш кад хоћеш!"
                                 "\nУ овом режиму други те не виде у претрази, али ти видиш њих."},

                    "collection": {"label": "Додај {target_name} у ✨ Колекцију",
                                   "title": "Додај {target_name} у ✨ Колекцију",
                                   "description": "Кад додаш у ✨ Колекцију, добијаш приступ профилу {target_name} и можеш да пишеш"}
        }}


BUTTONS_TEXT = {"begin":"Почни ✅",
                "reload": "Освежи 🔄",
                "back":"⬅️ Назад",
                "next":"➡️ Даље",
                "return":"⏮️ Мени",
                "delete": "🗑️ Обриши",
                "search_menu": {"start":"🔍 Почни претрагу"},
                "pay": "Плати Stars ⭐️",
                "reaction": {"LOVE":"☕ Дејт",
                             "SEX":"🔥 Кревет",
                             "CHAT":"💬 Ћаскање",
                             "SKIP":"⏩ Прескочи"},
                "match_menu":{"start":"💘 Поклапања",
                              "match":"💘 Match [{match_count}]",
                              "collection":"✨ Колекција [{collection_count}]",
                              "love":"Дејт [{love_count}]",
                              "sex":"Кревет [{sex_count}]",
                              "chat":"Ћаскање [{chat_count}]",
                              "add_to_collection":"Додај у Колекцију {amount} ⭐️",
                              "send_message":"✉️ Пошаљи"},
                "gender": {"man": "Дечко 🧔🏻",
                           "woman":"Девојка 👩🏻‍🦰",
                           "any":"Друго 👱"},
                "gender_search": {"man": "Тражим дечка 🧔🏻",
                                  "woman":"Тражим девојку 👩🏻‍🦰",
                                  "any":"Пол није битан 🧔🏻👩🏻‍🦰👱"},
                "incognito":{"not_active":"🫥 Инкогнито",
                             "on":"✅ Укључен",
                             "off":"🚫 Искључен"},
                "profile":{"edit":"✏ Измени",
                           "retry":"🔄 Понови"},
                "location":{"send":"📍 Пошаљи локацију",
                            "press":"📍 Кликни за локацију"}
                }


# 👩‍❤️‍💋‍👨 🧔 👩 👤


GENDER_LABELS = {
    Gender.MAN: "Дечко 🧔🏻",
    Gender.WOMAN: "Девојка 👩🏻‍🦰",
    Gender.ANY: "Друго 👱",
}


GENDER_SEARCH_LABELS = {
    Gender.MAN: "Тражим дечка 🧔🏻",
    Gender.WOMAN: "Тражим девојку 👩🏻‍🦰",
    Gender.ANY: "Пол није битан 🧔🏻👩🏻‍🦰👱",
}


GENDER_EMOJI = {
    Gender.MAN: "♂️",
    Gender.WOMAN: "♀️",
    Gender.ANY: "⚧️",
}
