from models import Gender


TEXT = {"user_profile":{"step_1": "🔘 ⚪ ⚪ ⚪ ⚪ ⚪\n\n"
                        "Привіт, <b>{first_name}</b>!\n"
                        "Готовий(-а) до нових знайомств?\n\n"
                        "Щоб почати, треба зробити кілька простих кроків:\n\n"
                        "🔸 Крок 1. Натискаючи «Почати реєстрацію», ти:"
                        "\n🔹Підтверджуєш, що тобі вже є 18 🪪"
                        '\n🔹Приймаєш <a href="{notion_site}">Користувацьку угоду</a>'
                        '\n🔹Погоджуєшся з <a href="{notion_site}">Політикою конфіденційності</a>',

                        "step_2": "🟢 🔘 ⚪ ⚪ ⚪ ⚪\n\n"
                        "🔸 Крок 2. Надішли своє місцезнаходження 🛰️\n\n"
                        "<i>Пошук відбуватиметься серед людей з твого міста та країни 📌</i>",

                        "step_3": "🟢 🟢 🔘 ⚪ ⚪ ⚪\n\n"
                        "🔸 Крок 3. Обери свою стать ⚧️",

                        "step_4": "🟢 🟢 🟢 🔘 ⚪ ⚪\n\n"
                        "🔸 Крок 4. Вкажи, кого шукаєш ⚧️",

                        "step_5": "🟢 🟢 🟢 🟢 🔘 ⚪\n\n"
                        "🔸 Крок 5. Надішли своє фото 🤳"
                        "\n<i>Бажано селфі, де добре видно обличчя</i>",

                        "step_6": "🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "🔸 Крок 6. Розкажи трохи про себе 📝"
                        "\n<i>Краще коротко — 2–3 рядки</i>",
                        
                        "username_error": "⚠️ Щоб користуватися ботом, потрібно встановити <b>username</b> у Telegram."
                        "\nЯк це зробити:"
                        "\n1️⃣ Відкрий Telegram → Налаштування → Ім’я користувача (tg://settings/username)"
                        "\n2️⃣ Придумай унікальне <b>Ім’я користувача</b>"
                        "\n3️⃣ Збережи зміни ✅"
                        "\nПісля цього повернись у бота та натисни «Повторити реєстрацію»",

                        "min_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ Крок 6 не виконаний"
                        "\nМінімум — {MIN_COUNT_SYMBOLS} символів"
                        "\nУ тебе — {text_length} символів"
                        "\nСпробуй доповнити опис і надішли ще раз",

                        "max_count_symbols_error":"🟢 🟢 🟢 🟢 🟢 🔘\n\n"
                        "❌ Крок 6 не виконаний."
                        "\nПеревищено ліміт: максимум — {MAX_COUNT_SYMBOLS} символів."
                        "\nУ тебе — {text_length} символів."
                        "\nСпробуй скоротити опис і надішли ще раз",
                        
                        "profile": "🪪 <b>{first_name}</b>"
                        "\n📌 {country_local}, {city_local}"
                        "\n{gender_emoji} {gender}"
                        "\n🔍 {gender_search}"
                        "\nПро себе: <i>{about_me}</i>",
                        
                        "get_location_message": "<i>Якщо ти користуєшся Telegram на комп’ютері, пройди цей крок на телефоні</i>",
                        "waiting": "Очікування ...",
                        },
       
        "notifications":{"18year":"Чудово! Ти підтвердив(-ла), що тобі вже 18+",
                         "gender": "Чудово! Ти вказав(-ла): {user_gender}",
                         "gender_search": "Чудово! Ти шукаєш: {gender_search}",
                         "not_found": "Поки що нікого немає у твоєму регіоні 😔",
                         "not_username": "Немає імені користувача ❌",
                         "reloaded": "Меню оновлено 🔄",
                         "empty": "Не знайдено",
                         "LOVE": "Ти хочеш піти на побачення з {name}",
                         "SEX": "Ти хочеш {name}",
                         "CHAT": "Ти хочеш поспілкуватися з {name}",
                         "SKIP": "Ти пропустив(-ла) {name}",
                         "delete": "Користувача видалено ❌",
                         "payment_sent": "Платіж надіслано ⭐️",
                         "unavailable": "Акаунт {name} зараз недоступний 🚫",
                         "incognito" : {
                             True: "Режим Інкогніто увімкнено ✅",
                             False: "Режим Інкогніто вимкнено 🚫"},
                         },
        "match_menu":{"start": "Тут ти можеш подивитися:"
                      "\n🔹 Совпадіння — ваші бажання збіглися"
                      "\n🔹 Колекція — у тебе є доступ до цих людей"
                      "\n🔹 Реакції інших на твою анкету",
                      "you_want": "Ви обидва хочете {reaction}",
                      "empty": {"LOVE": "Тут з’являться люди, які хочуть з тобою на ☕ <b>Побачення</b>",
                                "SEX": "Тут з’являться люди, які хочуть з тобою в 👩‍❤️‍💋‍👨 <b>Ліжко</b>",
                                "CHAT": "Тут з’являться люди, які хочуть 💬 <b>Поспілкуватися</b>"},
                      "match_empty": "Тут будуть люди, з якими у вас збіглися бажання"
                                    "\nТи зможеш написати їм ✉️",
                      "collection_empty": "Колекція порожня"
                                           "\nДодавай анкети в колекцію ✨."
                                           "\nЛюдям з колекції можна написати ✉️"},
        "search_menu":{"start": "🔍 Знайти партнера",
                       "not_found": "Поки що нікого не знайшлося у твоєму регіоні 😔"
                       "\nСпробуй пізніше ☕"},
        "payment": {"incognito":{"label": "Активувати Інкогніто",
                                 "title": "Активувати режим Інкогніто",
                                "description": "Купи один раз — і вмикай/вимикай, коли хочеш!"
                                "\nУ цьому режимі тебе не видно в пошуку, але ти можеш дивитися анкети інших."},

                    "collection": {"label": "Додати {target_name} в ✨ Колекцію",
                                   "title": "Додати {target_name} у ✨ Колекцію ",
                                   "description": "Додавши в ✨ Колекцію, ти отримаєш доступ до профілю {target_name} і зможеш їй/йому написати"}}
        }


BUTTONS_TEXT = {"begin":"Почати ✅",
                "reload": "Оновити 🔄",
                "back":"⬅️ Назад",
                "next":"➡️ Далі",
                "return":"⏮️ У меню",
                "delete": "🗑️ Видалити анкету",
                "search_menu": {"start":"🔍 Пошук"},
                "pay": "Оплатити через Stars ⭐️",
                "reaction": {"LOVE":"☕ Побачення",
                             "SEX":"🔥 Ліжко",
                             "CHAT": "💬 Чат",
                             "SKIP":"⏩ Пропустити"},
                "match_menu":{"start":"💘 Совпадіння",
                              "match":"💘 Совпадіння [{match_count}]",
                              "collection":"✨ Колекція [{collection_count}]",
                              "love":"Побачення [{love_count}]",
                              "sex":"Ліжко [{sex_count}]",
                              "chat":"Чат [{chat_count}]",
                              "add_to_collection":"У колекцію {amount} ⭐️",
                              "send_message":"✉️ Написати"},
                "gender": {"man": "Хлопець 🧔🏻",
                           "woman":"Дівчина 👩🏻‍🦰",
                           "any":"Інше 👱"},
                "gender_search": {"man": "Шукаю хлопця 🧔🏻",
                                  "woman":"Шукаю дівчину 👩🏻‍🦰",
                                  "any":"Стать не важлива 🧔🏻👩🏻‍🦰👱"},
                "incognito":{"not_active":"🫥 Стати Інкогніто",
                             "on":"✅ Інкогніто увімк.",
                             "off":"🚫 Інкогніто викл."},
                "profile":{"edit":"✏ Змінити анкету",
                           "retry":"🔄 Повторити"},
                "location":{"send":"📍 Надіслати локацію",
                            "press":"📍 Натисни, щоб надіслати"}}


GENDER_LABELS = {
    Gender.MAN: "Хлопець 🧔🏻",
    Gender.WOMAN: "Дівчина 👩🏻‍🦰",
    Gender.ANY: "Інше 👱",
}


GENDER_SEARCH_LABELS = {
    Gender.MAN: "Шукаю хлопця 🧔🏻",
    Gender.WOMAN: "Шукаю дівчину 👩🏻‍🦰",
    Gender.ANY: "Стать не важлива 🧔🏻👩🏻‍🦰👱",
}


GENDER_EMOJI = {
    Gender.MAN: "♂️",
    Gender.WOMAN: "♀️",
    Gender.ANY: "⚧️",
}
